Bwooce/tinygs_nRF52/src/main.cpp
    /* USB is already enabled in main() before this function is called */
}

/* -------------------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */
/* RadioLib (SX1262)                                                           */
/* -------------------------------------------------------------------------- */

static ZephyrHal radio_hal(lora_spi.bus, (struct spi_config *)&lora_spi.config);
static Module *radio_mod = nullptr;
SX1262 *radio = nullptr;  /* non-static — accessed from MQTT callback */

/* LoRa packet reception flag — set by DIO1 ISR */
static volatile bool lora_packet_received = false;

/* -------------------------------------------------------------------------- */
/* SNTP Time Sync                                                              */
/* -------------------------------------------------------------------------- */

static int64_t sntp_epoch_offset = 0; /* seconds: real_epoch = uptime_s + offset */
static bool time_synced = false;

static int64_t get_utc_epoch(void)
{
    if (!time_synced) return 0;
    return (int64_t)(k_uptime_get_32() / 1000) + sntp_epoch_offset;
}

/* SNTP callback — called from OpenThread context */
static void sntp_response_handler(void *aContext, uint64_t aTime, otError aResult)
{
    if (aResult == OT_ERROR_NONE) {
        uint32_t uptime_s = k_uptime_get_32() / 1000;
        sntp_epoch_offset = (int64_t)aTime - (int64_t)uptime_s;
        time_synced = true;
        LOG_INF("SNTP: synced, epoch=%llu", (unsigned long long)aTime);
    } else {
        LOG_WRN("SNTP: failed (%d)", (int)aResult);
    }
}

/**
 * Sync time via OpenThread SNTP client.
 * Uses Google NTP (2001:4860:4806:8::) — native IPv6, no NAT64 needed.
 */
static void sntp_sync(void)
{
    struct openthread_context *ot_ctx = openthread_get_default_context();
    if (!ot_ctx) return;

    otMessageInfo msgInfo;
    memset(&msgInfo, 0, sizeof(msgInfo));

    /* Google NTP IPv6: 2001:4860:4806:8:: */
    otIp6AddressFromString(OT_SNTP_DEFAULT_SERVER_IP, &msgInfo.mPeerAddr);
    msgInfo.mPeerPort = OT_SNTP_DEFAULT_SERVER_PORT;

    otSntpQuery query;
    query.mMessageInfo = &msgInfo;

    openthread_api_mutex_lock(ot_ctx);
    otError err = otSntpClientQuery(ot_ctx->instance, &query,
                                     sntp_response_handler, NULL);
    openthread_api_mutex_unlock(ot_ctx);

    if (err != OT_ERROR_NONE) {
        LOG_WRN("SNTP: query failed (%d)", (int)err);
    }
}

/* -------------------------------------------------------------------------- */
/* Doppler Compensation (P13 satellite propagator)                             */
/* -------------------------------------------------------------------------- */

#include "AioP13.h"

static uint32_t last_doppler_ms = 0;
#define DOPPLER_INTERVAL_MS 4000

/**
 * Compute Doppler shift using P13 propagator and apply to radio frequency.
 * Called every 4 seconds from the main loop. Requires valid TLE and time.
 *
 * NOTE: This requires real UTC time which we don't have (no NTP over Thread).
 * Doppler activates automatically when begine includes TLE data and
 * incorrect results without accurate time. When TLE data arrives and we
 * implement time sync, this will produce real Doppler corrections.
 */
static void doppler_update(void)
{
    if (!tinygs_radio.tle_valid || !tinygs_radio.doppler_enabled || !radio) {
        return;
    }

    /* SNTP time sync via OpenThread SNTP client → Google NTP IPv6 */
    if (!time_synced) {
        return; /* No SNTP time yet — can't predict orbits */
    }

    int64_t epoch = get_utc_epoch();
    /* Convert epoch to Y/M/D H:M:S */
    /* Simple conversion — good enough for satellite tracking */
    time_t t = (time_t)epoch;
    struct tm *utc = gmtime(&t);
    if (!utc) return;

    P13DateTime dt(utc->tm_year + 1900, utc->tm_mon + 1, utc->tm_mday,
                   utc->tm_hour, utc->tm_min, utc->tm_sec);
    P13Observer obs("GS", (double)tinygs_station_lat,
                    (double)tinygs_station_lon,
                    (double)tinygs_station_alt);
    P13Satellite_tGS sat(tinygs_radio.tle);

    sat.predict(dt);

    /* Get elevation to check if satellite is above horizon */
    double elevation = 0.0, azimuth = 0.0;
    sat.elaz(obs, elevation, azimuth);

    if (elevation <= 0.0) {
        return; /* Below horizon — no Doppler needed */
    }

    /* Compute Doppler — doppler() takes MHz, returns shifted MHz */
    double rx_freq_mhz = (double)tinygs_radio.frequency;
    double doppler_freq_mhz = sat.doppler(rx_freq_mhz, P13_FRX);
    float new_doppler = (float)((doppler_freq_mhz - rx_freq_mhz) * 1e6);

    /* Hysteresis — only retune if change exceeds tolerance */
    if (fabsf(new_doppler - tinygs_radio.freq_doppler) > tinygs_radio.doppler_tol) {
        tinygs_radio.freq_doppler = new_doppler;
        float effective_freq = tinygs_radio.frequency +
                              (tinygs_radio.freq_offset + tinygs_radio.freq_doppler) / 1e6f;
        radio->setFrequency(effective_freq);
        radio->startReceive();
        LOG_INF("Doppler: %.0f Hz → %.6f MHz (el=%.1f°)",
                (double)new_doppler, (double)effective_freq, elevation);
    }
}

/* -------------------------------------------------------------------------- */
/* LoRa RX                                                                     */
/* -------------------------------------------------------------------------- */

static void lora_rx_callback(void)
{
    lora_packet_received = true;
}

static void init_radio(void)
{
    LOG_INF("Initializing SX1262...");

    uint32_t cs   = radio_hal.addPin(&lora_cs);
    uint32_t rst  = radio_hal.addPin(&lora_reset);
    uint32_t busy = radio_hal.addPin(&lora_busy);
    uint32_t dio1 = radio_hal.addPin(&lora_dio1);

    /* Run HAL smoke tests before radio init */
    /* HAL smoke tests disabled for production — saves ~1KB flash
     * extern int zephyr_hal_run_tests(ZephyrHal *hal);
     * zephyr_hal_run_tests(&radio_hal); */

